Revit 2027 API
CurtainGrid.Grid1Angle Property
The angle for the U grid line pattern of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Grid1Angle { get; set; }
Public Property Grid1Angle As Double
	Get
	Set
public:
property double Grid1Angle {
	double get ();
	void set (double value);
}
member Grid1Angle : float with get, set
Property Value
Double
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace